/* 
Операція ... (rest) дозволяє зібрати групу незалежних елементів у нову колекцію. 
Синтаксично - це близнюк операції розподілу, але відрізнити їх просто - розподіл - 
коли ... знаходиться у правій частині операції присвоювання, а збирання - коли ... 
знаходиться в її лівій частині.
*/

// function foo(...nums) {
//   console.log(nums);
// }

// foo(1, 2, 3, 4, 5, 6, 7, 8);

/* 
Збирання остаточних параметрів
*/

// function foo(x, y, q, ...nums) {
//   console.log(nums);
// }

// foo(1, 2, 3, 4, 5, 6, 7, 8);

// ===============
